Tekla.Structures.Drawing.LineTypeAttributes
The LineTypeAttributes class contains basic attributes for lines.

Tekla.Structures.Drawing.LineTypeAttributes.Type
The type of the line (see Tekla.Structures.Drawing.LineTypes for options).

Tekla.Structures.Drawing.LineTypeAttributes.Color
The color of the line (see Tekla.Structures.Drawing.DrawingColors for options).

Tekla.Structures.Drawing.LineTypeAttributes.TrueColor
The true color (rgb enabled) of the line.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.LineTypeAttributes.#ctor
Creates a new line type attributes instance.

Tekla.Structures.Drawing.LineTypeAttributes.#ctor(Tekla.Structures.Drawing.LineTypes,Tekla.Structures.Drawing.DrawingColors)
Creates a new line type attributes instance with the given line type and color.
Throws System.ArgumentOutOfRangeException: Throws an exception if the color has an unsupported value. Value must be standard color value.
lineType: The line type to be used.
color: The color to be used.

Tekla.Structures.Drawing.LineTypeAttributes.#ctor(Tekla.Structures.Drawing.LineTypes,Tekla.Structures.Drawing.TeklaDrawingColor)
Creates a new line type attributes instance with the given line type and color.
lineType: The line type to be used.
color: The color to be used.

Tekla.Structures.Drawing.LineTypeAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.